cf/Catalogs/НоменклатураСайтLicota.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НоменклатураСайтLicota</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатураКопия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураОбщая</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиИзНоменклатуры</Name>
					<Comment>Брать значения настроек из справочника номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies_ru</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>h1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_description_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_keywords</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_keywords_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title_дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляДилеров</Name>
					<Comment>Выгружать товар на сайт дилеров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание_Дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Comment>для сайта и получения порций информации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СортировкаДопРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>views_count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>sorting_weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>link_title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>link_text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МнениеЭксперта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>view_type</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерЗакупок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синонимы</Name>
					<Comment>Перечиcляются через ","</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВместеСТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРодители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураСайтLicota</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/ТегиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТегиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Теги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ЧастныеСвойстваМенюОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЧастныеСвойстваМенюОбъекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыМеню</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Меню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/НоменклатураСайтLicota/Forms/ФормаГруппы/Ext/Form/Module.bsl
&НаКлиенте
Перем ИзмениласьНаследственность; // следит - стоит мучить наследников или нет
&НаКлиенте
Перем СледитьЗаНаследственностью; // будет отслеживать или нет (диалог выводить юзеру или нет)

&НаКлиенте
Перем мФормаВыбораТекстHTML, мФормаВыбораТекст;

#Область Предопреденные

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрочитатьМеню();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеРеквизиты.Загрузить(РаботаСНоменклатурой.ПолучитьДополнительныеРеквизитыНоменклатуры(Объект.Ссылка));
		
	GUID = Объект.Ссылка.УникальныйИдентификатор();
	
	//desh.avdonin {{18.03.2015#
	ПроверитьПоявлениеНовыхТеговДляСортировкиУКатегории();
	//}}desh.avdonin
	
КонецПроцедуры

Функция ПроверитьПоявлениеНовыхТеговДляСортировкиУКатегории()
	// Проверим появление новых категорий
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ 
		|	ТегиНоменклатуры.Тег КАК Тег
		|Поместить ТегиКатегории
		|ИЗ 
		|	РегистрСведений.ТегиНоменклатуры КАК ТегиНоменклатуры
		|ГДЕ
		|	ТегиНоменклатуры.Номенклатура.Родитель = &ТекущяяКатегория
		|СГРУППИРОВАТЬ ПО
		|	ТегиНоменклатуры.Тег
		|;
		|ВЫБРАТЬ 
		|	ТегиКатегории.Тег КАК Тег
		|ИЗ 
		|	ТегиКатегории КАК ТегиКатегории
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	Справочник.Номенклатура.ПорядокТегов КАК ТекущиеТеги
		|ПО
		|	ТекущиеТеги.Тег = ТегиКатегории.Тег И ТекущиеТеги.Ссылка = &ТекущяяКатегория
		|ГДЕ
		|	ТекущиеТеги.Ссылка Есть NULL
		|";
		
		Запрос.УстановитьПараметр("ТекущяяКатегория", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			новСтрока = Объект.ПорядокТегов.Добавить();
			новСтрока.Тег = Выборка.Тег;
		КонецЦикла;
	КонецЕсли;
КонецФункции // ПроверитьПоявлениеНовыхТеговДляСортировкиУКатегории()

&НаСервере
Функция ЕстьПодчиненныеЭлементы()
	
	СсылкаОбъекта = Объект.Ссылка;
	
	Если СсылкаОбъекта.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 ИСТИНА КАК Подчинение ИЗ Справочник.Номенклатура ГДЕ Ссылка <> &Ссылка И Ссылка В ИЕРАРХИИ(&Ссылка)");
	Запрос.УстановитьПараметр("Ссылка", СсылкаОбъекта);
	
	Выполнение = Запрос.Выполнить();
	Если Выполнение.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Выборка = Выполнение.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Подчинение = ИСТИНА;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СледитьЗаНаследственностью = ЕстьПодчиненныеЭлементы();
	ИзмениласьНаследственность = Ложь;
	ОбновитьHTML();
	
	ОбновитьВидимостьЭлементов();
	
	ОбновитьКартинку();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраним описание HTML
	
	Если БылоИзмененоHTMLОписание Тогда ТекущийОбъект.Описание = СокрЛП(КонвертацияТипов.ПолучитьТекстHTMLВнутри_Body(ОписаниеHTML)) КонецЕсли;
	
	// Сохраним новые значения свойств
	стрОшибки = "";
	Если НЕ (РаботаСНоменклатурой.СохранитьДополнительныеРеквизиты(
						ТекущийОбъект.Ссылка, 
						ДополнительныеРеквизиты.Выгрузить(), 
						ПараметрыЗаписи.ИзмениласьНаследственность, стрОшибки) И
	// Сохраним меню
	
			СохранитьМеню()) Тогда
			
		Отказ = Истина;  Если НЕ ПустаяСтрока(стрОшибки) Тогда Сообщить(стрОшибки); КонецЕсли; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("ИзмениласьНаследственность", ИзмениласьНаследственность);
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	//Если Элементы.УдалитьДополнительныйРеквизит.Видимость Тогда
	//	Элементы.УдалитьДополнительныйРеквизит.Доступность = ТаблицаСвойств.Количество();
	//КонецЕсли;
	
	Элементы.НадписьОЗаписеНаследников.Видимость = СледитьЗаНаследственностью И ИзмениласьНаследственность;
	
	Элементы.ДополнительныеРеквизиты.ИзменятьПорядокСтрок 	= Объект.СортировкаДопРеквизитов;
	Элементы.ДекорацияДопРекв_СорттировкаВкл.Доступность 	= Не Объект.СортировкаДопРеквизитов;
	Элементы.ДекорацияДопРекв_СорттировкаВыкл.Доступность 	= Объект.СортировкаДопРеквизитов;
	
КонецПроцедуры

#Область Меню

&НаСервере
Процедура ПрочитатьМеню()
	
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.ЧастныеСвойстваМенюОбъекта ГДЕ Объект = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаМеню.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция СохранитьМеню()
	
	ВрТаблица = ТаблицаМеню.Выгрузить();
	ВрТаблица.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВрТаблица.ЗаполнитьЗначения(Объект.Ссылка, "Объект");
	
	Набор = РегистрыСведений.ЧастныеСвойстваМенюОбъекта.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Объект.Ссылка);
	Набор.Загрузить(ВрТаблица);
	
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Набор);
	
КонецФункции

#КонецОбласти

#Область HTML_описание

&НаКлиенте
Процедура ОбновитьHTML()
	
	ОписаниеHTML 		= ДиалогиСПользователем.СформироватьТекстHTML(Объект.Описание);
	ОписаниеHTML_Дилер 	= ДиалогиСПользователем.СформироватьТекстHTML(Объект.Описание_Дилер);
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьОписаниеHTML(Команда)
	
	мФормаВыбораТекстHTML = ОткрытьФорму("ОбщаяФорма.РедактированияТекстаHTML", Новый Структура("ЗакрыватьПриВыборе, Текст, НеПоказыватьЗаголовокHTML", Истина, ОписаниеHTML, Истина), ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура РедактироватьОписаниеТекстом(Команда)
	
	мФормаВыбораТекст = ОткрытьФорму("ОбщаяФорма.РедактированияТекстаHTMLВФорматированномДокументе", Новый Структура("ЗакрыватьПриВыборе, Текст", Истина, ОписаниеHTML), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора = мФормаВыбораТекстHTML Тогда
		
		ОписаниеHTML = ВыбранноеЗначение; 
		Модифицированность = Истина;
		БылоИзмененоHTMLОписание = Истина;
		
	ИначеЕсли ИсточникВыбора = мФормаВыбораТекст Тогда
		
		ОписаниеHTML = ВыбранноеЗначение; 
		Модифицированность = Истина; 
		БылоИзмененоHTMLОписание = Истина; КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если БылоИзмененоHTMLОписание Тогда ТекущийОбъект.Описание = СокрЛП(КонвертацияТипов.ПолучитьТекстHTMLВнутри_Body(ОписаниеHTML)) КонецЕсли;
	
	// Сохраним наши свойства которые будут записаны в базу
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("БудутЗаписаны", 
			Новый Структура("Меню, Свойства", ТаблицаМеню.Выгрузить(), ДополнительныеРеквизиты.Выгрузить()));
			
	
КонецПроцедуры

#КонецОбласти

#Область Дополнительные_группы

&НаСервере
Процедура ЗагрузитьСписокгруппКВыбору()
	
	Список = Новый СписокЗначений;
	Для Каждого Строка Из Объект.ДополнительныеРодители Цикл
		Список.Добавить(Строка.Родитель);
	КонецЦикла;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка,
	|	ВЫБОР КОГДА Ссылка В(&ВыбранныеГруппы) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа 		= ИСТИНА И
	|	ПометкаУдаления = ЛОЖЬ И
	|	Ссылка <> &ОсновнаяГруппа
	|");
	
	Запрос.УстановитьПараметр("ОсновнаяГруппа", 	Объект.Родитель);
	Запрос.УстановитьПараметр("ВыбранныеГруппы", 	Список);
	
	СписокВыбораГруппы.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СписокВыбораГруппы.Добавить(Выборка.Ссылка,,Выборка.Пометка);
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбратьГруппы(Команда)
	
	ЗагрузитьСписокгруппКВыбору();
	
	Если СписокВыбораГруппы.ОтметитьЭлементы("Отметить дополнительные группы:") Тогда
		
		Объект.ДополнительныеРодители.Очистить();
		
		Для Каждого Элемент Из СписокВыбораГруппы Цикл
			Если Элемент.Пометка Тогда
			
				Объект.ДополнительныеРодители.Добавить().Родитель = Элемент.Значение;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Картинки

&НаКлиенте
Процедура ОбновитьКартинку()
	
	//АдресКартинки = Картинки.ПолучитьНавигационнуюСсылкуОсновногоИзображения(Объект.Ссылка);
	
	АдресКартинки = Картинки.ПолучитьНавигационнуюСсылкуОсновногоИзображения(Объект.НоменклатураКопия);
	
КонецПроцедуры

&НаКлиенте
Процедура АватарНажатие1(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Выберем картинку
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДВ.Выбрать() Тогда
		
		стрОшибки 	= "";
		ИмяФайла 	= Сред(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.Каталог) + 1);
		
		Если Картинки.ОбновитьКартинкуОсновногоИзображения(	Новый Картинка(ДВ.ПолноеИмяФайла),
															Объект.Ссылка,,,стрОшибки) Тогда
			ОбновитьКартинку();
			//ЭтаФорма.ОбновитьОтображениеДанных();
			
		Иначе
			
			ОбщиеФункции.СообщитьТекст(стрОшибки);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Дополнительные_реквизиты

&НаКлиенте
Функция ПользовательРазрешаетИзменятьНаследственность()
	
	Возврат 
			ИзмениласьНаследственность ИЛИ
			
			Не СледитьЗаНаследственностью ИЛИ
			
			(	СледитьЗаНаследственностью И
					Вопрос("Будут измененны все подчиненные элементы при записи,
					|это может занять продолжительное время,
					|Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да
			);
			
КонецФункции

&НаКлиенте
Процедура ДополнительныеРеквизитыНаследоватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	
	// Проверим что низя изменять наследственность верхнего по уровню
	
	//Если 	Не ТекДанные.Владелец.Пустая() И
	//		ТекДанные.Владелец <> Объект.Ссылка Тогда
	//		
	//	ТекДанные.Наследовать = Не ТекДанные.Наследовать;
	//	Возврат;
	//		
	//КонецЕсли;
	
	// Проверим что юзер согласен на изменение всех подчиненных
	
	Если Не ПользовательРазрешаетИзменятьНаследственность() Тогда
		
		ТекДанные.Наследовать = Не ТекДанные.Наследовать;
		
	Иначе
		
		ИзмениласьНаследственность = Истина;
		ОбновитьВидимостьЭлементов();
		
	КонецЕсли;
				
КонецПроцедуры
&НаКлиенте
Процедура ДополнительныеРеквизитыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ДополнительныеРеквизиты.ТекущиеДанные.Наследовать Тогда
		
		Если Не ПользовательРазрешаетИзменятьНаследственность() Тогда
		
			Отказ = Истина;
			
		Иначе
			
			ИзмениласьНаследственность = Истина;
			ОбновитьВидимостьЭлементов();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ДополнительныеРеквизитыПередУдалением(Элемент, Отказ)
	
	Если Элементы.ДополнительныеРеквизиты.ТекущиеДанные.Наследовать Тогда
		
		Если Не ПользовательРазрешаетИзменятьНаследственность() Тогда
		
			Отказ = Истина;
			
		Иначе
			
			ИзмениласьНаследственность = Истина;
			ОбновитьВидимостьЭлементов();
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	
	// Определим доступность колонок таблицы
	
	Если ТекДанные <> Неопределено Тогда
	
		ЭтоСтрокаРодителя = Не ТекДанные.Владелец.Пустая() И ТекДанные.Владелец <> Объект.Ссылка;
		
		Элементы.ДополнительныеРеквизитыНаследовать.ТолькоПросмотр 			= ЭтоСтрокаРодителя;
		Элементы.ДополнительныеРеквизитыОтображатьВСписке.ТолькоПросмотр 	= ЭтоСтрокаРодителя;
		Элементы.ДополнительныеРеквизитыСвойство.ТолькоПросмотр 			= ЭтоСтрокаРодителя;
		
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияДопРекв_СорттировкаВклНажатие(Элемент)
	
	Если ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Наследовать", Истина)).Количество() Тогда
		
		Если Не ПользовательРазрешаетИзменятьНаследственность() Тогда
		
			Возврат;
			
		Иначе
			
			ИзмениласьНаследственность = Истина;
			
		КонецЕсли;
	КонецЕсли;

	Объект.СортировкаДопРеквизитов = Истина;
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры
&НаКлиенте
Процедура ДекорацияДопРекв_СорттировкаВыклНажатие(Элемент)
	
	Если ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Наследовать", Истина)).Количество() Тогда
		
		Если Не ПользовательРазрешаетИзменятьНаследственность() Тогда
		
			Возврат;
			
		Иначе
			
			ИзмениласьНаследственность = Истина;
			
		КонецЕсли;
	КонецЕсли;

	Объект.СортировкаДопРеквизитов = Ложь;
	ОбновитьВидимостьЭлементов();

	
КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПриИзменении(Элемент)
	
	Если 	СледитьЗаНаследственностью И 
			Элементы.ДополнительныеРеквизиты.ТекущиеДанные.Наследовать И 
			ЗначениеЗаполнено(Элементы.ДополнительныеРеквизиты.ТекущиеДанные.Значение) Тогда
		
		ОбщиеФункции.СообщитьТекст("Не рекомендуеться устанавливать значение в группе номенклатуры, 
		|устанавливаемое значение свойства, перезапишет значение всех товаров подчиненных этой группе!",
		"ДополнительныеРеквизиты[" + Формат(Элементы.ДополнительныеРеквизиты.ТекущаяСтрока,"ЧГ=") + "].Значение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыКлючевойПриИзменении(Элемент)
	Строки = ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Ключевой", Истина));
	Если Строки.Количество() > 1 Тогда
		ТекДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;	
		Если ТекДанные <> Неопределено Тогда ТекДанные.Ключевой = Ложь; Сообщить("Ключевым может быть только одно свойство"); КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
